# Реализовать функцию my_func(),
# которая принимает три позиционных аргумента, и
# возвращает сумму наибольших двух аргументов.

def my_max(var_1, var_2, var_3):
    return max(var_1, var_2, var_3)


print(my_max(1, 8, 2))
