# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с
# одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

lis = [7, 6, 3, 3, 2]
i = len(lis)
while True:
    inp = input("Enter number, for Exit enter 'q': ")
    if inp == "q":
        break
    inp_int = int(inp)

    for index, l in enumerate(lis):
        if l < inp_int:
            i = index
        if inp_int > l:
            break
    # для проверки что вставляется после повторяющихся можно использовать inp
    lis.insert(i, inp_int)
    print(lis, i)

